[
{"q":"Вас попросили разработать калькулятор. Какой из предложенных вариантов вы выберете?",
"as":[
	{"a":"Разработать веб приложение чтобы иметь доступ к калькулятору с любого устройства","t":"ВР"},
	{"a":"Разработать мобильную версию приложения для использования калькулятора оффлайн","t":"ПИ"},
	{"a":"Разработать консольное приложение с повышенной отказоустойчивостью","t":"ИБ"},
	{"a":"Разработать алгоритм для максимально точного калькулятора","t":"ПМиИ"}
]},
{"q":"Ваш знакомый увлекся бизнесом и просит вас посоветовать crm систему для него. Ваши действия?",
"as":[
	{"a":"Посоветовать вести учет в excel пока он не поймет какие именно возможности ему нужны","t":"ВР"},
	{"a":"Посоветовать использовать готовые облачные решения","t":"КС"},
	{"a":"Предложите написать crm специально под его задачи","t":"ПИ"},
	{"a":"Посоветуете популярные настольные решения и свой сервер","t":"ИБ"}
]},
{"q":"Ваша бабушка постоянно теряет свой смартфон и вы хотите ей помочь. Ваши действия?",
"as":[
	{"a":"Покажите ей сайт для отслеживания телефона","t":"ВР"},
	{"a":"Установите софт для отслеживания устройства через Telegram","t":"ИБ"},
	{"a":"Установите приложение издающее звуковой сигнал при определенных условиях","t":"ПИ"},
	{"a":"Спроектируете кнопку которая отправляет сигнал на телефон по определенному протоколу","t":"САПР"}
]},
{"q":"У вас скоро экзамен вам необходимо подготовить подсказки. Ваши действия?",
"as":[
	{"a":"Найти сайт со шпаргалками","t":"ВР"},
	{"a":"Найти приложение со шпаргалками","t":"ПИ"},
	{"a":"Попытаться распознать текст из записей в тетради","t":"КС"},
	{"a":"Записать шпаргалки на листе используя методики шифрования","t":"ИБ"}
]},
{"q":"Вы работаете в компании и вас попросили разработать систему оповещения сотрудников. Ваши действия?",
"as":[
	{"a":"Разработать устройства для передачи сообщений","t":"САПР"},
	{"a":"Найти людей которые уже делали подобные системы и договориться о реализации у вас в фирме","t":"ИТМ"},
	{"a":"Объединить компьютеры в одну сеть и написать программу для оповещения","t":"ПИ"},
	{"a":"Доработать известные решения убрав все лишнее","t":"ИБ"}
]},
{"q":"Вы отправляетесь в путешествие. Вам нужно найти авиабилеты. Чем вы воспользуетесь?",
"as":[
	{"a":"Сайтом надежной авиакомпании","t":"ИБ"},
	{"a":"Сайтом агрегатором билетов","t":"КС"},
	{"a":"Мобильным приложением","t":"ПИ"},
	{"a":"Спрошу у друзей как они искали билеты","t":"ИТМ"}
]},
{"q":"Ваши дела плохи. Вы на грани отчисления. Ваши родители ждут списков на отчисление. Ваши действия?",
"as":[
	{"a":"Удалить свою фамилию из списка в html странице и отправить ссылку родителям","t":"ВР"},
	{"a":"Попытаться взломать систему института","t":"ИБ"},
	{"a":"Узнать у людей в институте какие есть выходы из ситуации","t":"ИТМ"},
	{"a":"Сформировать свой документ мигрировав данные из официального","t":"КС"}
]},
{"q":"Ваш руководитель требует от вас проект на свободную тему. Ваши действия?",
"as":[
	{"a":"Найти готовый проект в интернете и доработать его","t":"ВР"},
	{"a":"Написать программу упрощающую ваши основные обязанности","t":"ПИ"},
	{"a":"Попробовать себя в сфере с нейросетями","t":"КС"},
	{"a":"Спроектировать материальный предмет чтобы распечатать его на 3D принтере","t":"САПР"}
]},
{"q":"Вы заканчиваете институт и вас приглашают работать в малоизвестную компанию. Что вы сделает для начала?",
"as":[
	{"a":"Посмотреть официальный сайт и оценить потенциал компании","t":"ВР"},
	{"a":"Посмотреть официальную статистику и предположите примерное развитие компании","t":"КС"},
	{"a":"Просмотрите все документы компании и их структуру взаимодействия","t":"ПИ"},
	{"a":"Встретитесь с человеком уже работающим в этой компании и узнаете обо всем изнутри","t":"ИТМ"}
]},
{"q":"Вы заведуете большим отделом компании. начальник просит от вас ответ по эффективности сотрудников. Ваши действия?",
"as":[
	{"a":"Сформировать отчет с помощью запроса к базе данных","t":"КС"},
	{"a":"Узнать у неэффективных сотрудников причины и сформировать отчет основываясь на личном восприятии","t":"ИТМ"},
	{"a":"Сформировать математическую модель учитывающую эффективность сотрудников по определенной формуле","t":"ПМиИ"},
	{"a":"Попытаться составить отчет на основании документов оформленных в crm системе","t":"ПИ"}
]}
]